#Область ПодключениеОбработкиКБСП

Функция СведенияОВнешнейОбработке() Экспорт

	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();

	ПараметрыРегистрации.Вставить("Вид",ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка());
	ПараметрыРегистрации.Вставить("Версия","1.1");
	//ПараметрыРегистрации.Вставить("Назначение", Новый Массив);
	ПараметрыРегистрации.Вставить("Наименование","Плагин_RabbitMQ_экспорт_Справочник_ФранчайзинговыеМагазины");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Информация","Плагин_RabbitMQ_экспорт_Справочник_ФранчайзинговыеМагазины");
	ПараметрыРегистрации.Вставить("ВерсияБСП", "3.1.5.180");
	//ПараметрыРегистрации.Вставить("ОпределитьНастройкиФормы", Ложь);
	
	
	ТипКоманды = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	ДобавитьКоманду(ПараметрыРегистрации.Команды, 
		"Открыть форму : Плагин_RabbitMQ_экспорт_Справочник_ФранчайзинговыеМагазины",
		"Форма_Плагин_RabbitMQ_экспорт_Справочник_ФранчайзинговыеМагазины",
		ТипКоманды, 
		Ложь) ;
	
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")

	//ТаблицаКоманд.Колонки.Добавить("Представление", РеквизитыТабличнойЧасти.Представление.Тип);
	//ТаблицаКоманд.Колонки.Добавить("Идентификатор", РеквизитыТабличнойЧасти.Идентификатор.Тип);
	//ТаблицаКоманд.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	//ТаблицаКоманд.Колонки.Добавить("ПоказыватьОповещение", РеквизитыТабличнойЧасти.ПоказыватьОповещение.Тип);
	//ТаблицаКоманд.Колонки.Добавить("Модификатор", РеквизитыТабличнойЧасти.Модификатор.Тип);
	//ТаблицаКоманд.Колонки.Добавить("Скрыть",      РеквизитыТабличнойЧасти.Скрыть.Тип);
	//ТаблицаКоманд.Колонки.Добавить("ЗаменяемыеКоманды", РеквизитыТабличнойЧасти.ЗаменяемыеКоманды.Тип);
	
//           ** Использование - Строка - тип команды:
//               "ВызовКлиентскогоМетода",
//               "ВызовСерверногоМетода",
//               "ЗаполнениеФормы",
//               "ОткрытиеФормы" или
//               "СценарийВБезопасномРежиме".
//               Для получения типов команд рекомендуется использовать функции
//               ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКоманды<ИмяТипа>.
//               В комментариях к этим функциям также даны шаблоны процедур-обработчиков команд.

	НоваяКоманда = ТаблицаКоманд.Добавить() ;
	НоваяКоманда.Представление = Представление ;
	НоваяКоманда.Идентификатор = Идентификатор ;
	НоваяКоманда.Использование = Использование ;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение ;
	НоваяКоманда.Модификатор = Модификатор ;
КонецПроцедуры


#КонецОбласти 	


Функция ВыгрузитьОбъект(ДанныеСсылка) Экспорт
	
	Если ТипЗнч(ДанныеСсылка) = Тип("СправочникСсылка.ФранчайзинговыеМагазины") Тогда
		Обк = ДанныеСсылка.ПолучитьОбъект(); 
	Иначе 
		Обк = ДанныеСсылка; 
	КонецЕсли;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, Символы.Таб);
	ЗаписьJson = Новый ЗаписьJSON;
	ЗаписьJson.УстановитьСтроку(ПараметрыЗаписиJSON);
	// Это основной объект json-сообщения
	СтруктураОбъекта = Новый Структура;
	СтруктураОбъекта.Вставить("source", "ERP");
	СтруктураОбъекта.Вставить("type", Обк.метаданные().ПолноеИмя());
	СтруктураОбъекта.Вставить("datetime", XMLСтрока(ТекущаяДатаСеанса()));
	identification = ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.Ссылка);
	СтруктураОбъекта.Вставить("identification", identification);
	//	DEFINITION          
	definition = ксп_ЭкспортСлужебный.СоздатьУзелDefinition(Обк.Ссылка);
	definition.Вставить("ВидМагазина", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.ВидМагазина));
	definition.Вставить("Город", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.Город));
	definition.Вставить("НазваниеТЦУлицы", Обк.НазваниеТЦУлицы);
	definition.Вставить("Бренд", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.Бренд));
	definition.Вставить("СозданВЛркальнойБазе", Обк.СозданВЛокальнойБазе);
	definition.Вставить("Ответственный", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.Ответственный));
	definition.Вставить("Контрагент", ксп_ЭкспортСлужебный.СоздатьУзелIdentification(Обк.Владелец)); 
	//------------------------------------------------------ ФИНАЛ

	СтруктураОбъекта.Вставить("definition", definition);
	ЗаписатьJSON(ЗаписьJson, СтруктураОбъекта);
	json = ЗаписьJson.Закрыть();
	Возврат json;
	
КонецФункции

Функция ПолучитьОбъектыДляВыгрузки(Узел) Экспорт
	
	Запрос = Новый запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФранчайзинговыеМагазины.Ссылка КАК Ссылка,
	|	ФранчайзинговыеМагазины.Владелец КАК Владелец,
	|	ФранчайзинговыеМагазины.Город КАК Город,
	|	ФранчайзинговыеМагазины.ВидМагазина КАК ВидМагазина,
	|	ФранчайзинговыеМагазины.НазваниеТЦУлицы КАК НазваниеТЦУлицы,
	|	ФранчайзинговыеМагазины.Бренд КАК Бренд,
	|	ФранчайзинговыеМагазины.СозданВЛокальнойБазе КАК СозданВЛокальнойБазе,
	|	ФранчайзинговыеМагазины.Ответственный КАК Ответственный
	|ИЗ
	|	Справочник.ФранчайзинговыеМагазины.Изменения КАК ФранчайзинговыеМагазиныИзменения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФранчайзинговыеМагазины КАК ФранчайзинговыеМагазины
	|		ПО ФранчайзинговыеМагазиныИзменения.Ссылка = ФранчайзинговыеМагазины.Ссылка
	|ГДЕ
	|	ФранчайзинговыеМагазиныИзменения.Узел = &НужныйУзелПланаОбмена";
	
	Запрос.УстановитьПараметр("НужныйУзелПланаОбмена", Узел);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
	
КонецФункции

Функция getRoutingKey() Экспорт
	Возврат "static";
КонецФункции

